; domain
(define (domain p2)
(:requirements :strips :typing :action-costs)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:functions
    (total-cost)
    (fly-cost ?location_from - location ?location_to - location)    
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))  
        (increase (total-cost) 1)   
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)
        (increase (total-cost) (fly-cost ?location_from ?location_to))        
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
        (increase (total-cost) 1)  
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l7_p7_c7_g7_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(person-at person1 loc5)
	(person-at person2 loc5)
	(person-at person3 loc3)
	(person-at person4 loc1)
	(person-at person5 loc7)
	(person-at person6 loc5)
	(person-at person7 loc6)
(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 174)
	(= (fly-cost depot loc2) 227)
	(= (fly-cost depot loc3) 186)
	(= (fly-cost depot loc4) 170)
	(= (fly-cost depot loc5) 221)
	(= (fly-cost depot loc6) 141)
	(= (fly-cost depot loc7) 165)
	(= (fly-cost loc1 depot) 174)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 156)
	(= (fly-cost loc1 loc3) 150)
	(= (fly-cost loc1 loc4) 166)
	(= (fly-cost loc1 loc5) 118)
	(= (fly-cost loc1 loc6) 166)
	(= (fly-cost loc1 loc7) 10)
	(= (fly-cost loc2 depot) 227)
	(= (fly-cost loc2 loc1) 156)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 48)
	(= (fly-cost loc2 loc4) 76)
	(= (fly-cost loc2 loc5) 45)
	(= (fly-cost loc2 loc6) 106)
	(= (fly-cost loc2 loc7) 152)
	(= (fly-cost loc3 depot) 186)
	(= (fly-cost loc3 loc1) 150)
	(= (fly-cost loc3 loc2) 48)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 31)
	(= (fly-cost loc3 loc5) 71)
	(= (fly-cost loc3 loc6) 59)
	(= (fly-cost loc3 loc7) 143)
	(= (fly-cost loc4 depot) 170)
	(= (fly-cost loc4 loc1) 166)
	(= (fly-cost loc4 loc2) 76)
	(= (fly-cost loc4 loc3) 31)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 100)
	(= (fly-cost loc4 loc6) 33)
	(= (fly-cost loc4 loc7) 158)
	(= (fly-cost loc5 depot) 221)
	(= (fly-cost loc5 loc1) 118)
	(= (fly-cost loc5 loc2) 45)
	(= (fly-cost loc5 loc3) 71)
	(= (fly-cost loc5 loc4) 100)
	(= (fly-cost loc5 loc5) 1)
	(= (fly-cost loc5 loc6) 124)
	(= (fly-cost loc5 loc7) 115)
	(= (fly-cost loc6 depot) 141)
	(= (fly-cost loc6 loc1) 166)
	(= (fly-cost loc6 loc2) 106)
	(= (fly-cost loc6 loc3) 59)
	(= (fly-cost loc6 loc4) 33)
	(= (fly-cost loc6 loc5) 124)
	(= (fly-cost loc6 loc6) 1)
	(= (fly-cost loc6 loc7) 157)
	(= (fly-cost loc7 depot) 165)
	(= (fly-cost loc7 loc1) 10)
	(= (fly-cost loc7 loc2) 152)
	(= (fly-cost loc7 loc3) 143)
	(= (fly-cost loc7 loc4) 158)
	(= (fly-cost loc7 loc5) 115)
	(= (fly-cost loc7 loc6) 157)
	(= (fly-cost loc7 loc7) 1)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
))
(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate1 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space1)
   goals met: 1 of 8
2. (put-crate-in-carrier crate7 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space2)
   goals met: 1 of 8
3. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 0 of 8
4. (pick-and-drop crate1 loc5 drone1 carrier1 space1 person1 food)
   deleted: (crate-at-space crate1 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person1 food)
   goals met: 1 of 8
5. (move-carrier loc5 loc3 drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 1 of 8
6. (pick-and-drop crate7 loc3 drone1 carrier1 space2 person3 medicine)
   deleted: (crate-at-space crate7 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person3 medicine)
   goals met: 2 of 8
7. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 8
8. (put-crate-in-carrier crate6 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space1)
   goals met: 3 of 8
9. (move-carrier depot loc1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 2 of 8
10. (pick-and-drop crate6 loc1 drone1 carrier1 space1 person4 medicine)
   deleted: (crate-at-space crate6 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person4 medicine)
   goals met: 3 of 8
11. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 8
12. (put-crate-in-carrier crate5 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space1)
   goals met: 4 of 8
13. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 3 of 8
14. (pick-and-drop crate5 loc6 drone1 carrier1 space1 person7 medicine)
   deleted: (crate-at-space crate5 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person7 medicine)
   goals met: 4 of 8
15. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 8
16. (put-crate-in-carrier crate4 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space1)
   goals met: 5 of 8
17. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 4 of 8
18. (pick-and-drop crate4 loc5 drone1 carrier1 space1 person1 medicine)
   deleted: (crate-at-space crate4 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person1 medicine)
   goals met: 5 of 8
19. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 8
20. (put-crate-in-carrier crate3 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space1)
   goals met: 6 of 8
21. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 5 of 8
22. (pick-and-drop crate3 loc5 drone1 carrier1 space1 person2 medicine)
   deleted: (crate-at-space crate3 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person2 medicine)
   goals met: 6 of 8
23. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 8
24. (put-crate-in-carrier crate2 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space1)
   goals met: 7 of 8
25. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 6 of 8
26. (pick-and-drop crate2 loc5 drone1 carrier1 space1 person6 medicine)
   deleted: (crate-at-space crate2 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person6 medicine)
   goals met: 7 of 8
27. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 8
